app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."complete" ASC, "tasks"."created_at" ASC
---
  def index

    @tasks = Task.all
    @tasks = Task.order(:complete)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @result_task = Task.find(params[:id])

INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdf123"], ["description", "asdfssdadsa"], ["completion_date", Thu, 23 Mar 2017], ["created_at", 2017-03-22 19:53:53 UTC], ["updated_at", 2017-03-22 19:53:53 UTC]]
---
    task = Task.create task_params

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "laundry"], ["description", "wash whites and darks and stuffff"], ["created_at", 2017-03-24 04:04:40 UTC], ["updated_at", 2017-03-24 04:04:40 UTC]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "complete" = ?, "completion_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", nil], ["description", nil], ["complete", true], ["completion_date", Mon, 27 Mar 2017], ["updated_at", 2017-03-27 08:45:11 UTC], ["id", 13]]
---
    task = Task.find(params[:id])
    if params[:task][:name] !=nil
      task.name = params[:task][:name]
    end
    if params[:task][:description] != nil
      task.description = params[:task][:description]
    end
    task.complete = params[:task][:complete]

    if task.complete
      task.completion_date = DateTime.now
      # task.completion_date = params[:task][:updated_at]
    else
      task.completion_date = nil
      # params[:task][:updated_at].to_datetime
    end

    if task.save

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 7]]
---
  def destroy
    Task.destroy(params[:id])